public class TODO 
{
    //TODO На поле есть вражеские объекты 1 и 2 с секторами видимости. Отобразить их сектора видимости.
    //TODO Враги перемещаются по карте по случайно сгенерированному маршруту в режиме патрулирования. Создать для них режим патрулирования и сгенерировать им пути патрулирования. Скорость перемещения вражеских объектов равна скорости нашего героя.  

    //TODO При движении героя, те по нажатию на клавишу перемещения (скорость перемещения персонажа 1 клетка в секунду) срабатывает датчик шума, можно показать его в формате столбика (простой вариант цифра которая показывает уровень шума). 
    //Интенсивность шума возрастает при перемещении со скоростью: +3 ед.шума в секунду, спадающее со скоростью 1 ед.шума за 0.5 сек.в момент остановки Героя.
    //При достижении уровня шума 10 баллов, вражеские объекты обнаруживают вас (выделить их состояние другим цветом) и бросают свой путь патрулирования, стремятся к герою чтобы поймать его.

    //TODO Перед основной сценой создайте меню начала игры и завершение уровня.

}
